build-essential

terminator
neofetch
git
gpg
curl
grep
htop
vim
zsh
fzf
cmake
code

google-chrome-stable

docker-buildx-plugin
docker-ce
docker-ce-cli
docker-compose-plugin

gnome-shell-extension-manager
gnome-shell-extensions

libpython3-dev
python3-pip
python3-vcstools